Revit 2024 API
PointCloudOverrideSettings Constructor
 Constructs a settings object with default values.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public PointCloudOverrideSettings()
Visual Basic
Public Sub New
Visual C++
public:
PointCloudOverrideSettings()
See Also
PointCloudOverrideSettings Class
PointCloudOverrideSettings Overload
Autodesk.Revit.DB.PointClouds Namespace